Show / Hide Table of Contents
Class GrpcMessage
Inheritance
System.Object
GrpcMessage
Implements
Google.Protobuf.IMessage<GrpcMessage>
System.IEquatable<GrpcMessage>
Google.Protobuf.IDeepCloneable<GrpcMessage>
Google.Protobuf.IBufferMessage
Google.Protobuf.IMessage
Inherited Members
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public sealed class GrpcMessage : IMessage<GrpcMessage>, IEquatable<GrpcMessage>, IDeepCloneable<GrpcMessage>, IBufferMessage, IMessage
Constructors
Improve this Doc   View Source
GrpcMessage()
Declaration
public GrpcMessage()
Improve this Doc   View Source
GrpcMessage(GrpcMessage)
Declaration
public GrpcMessage(GrpcMessage other)
Parameters
 Type |  Name |  Description
 GrpcMessage |  other
Fields
Improve this Doc   View Source
ClientIdFieldNumber
Field number for the "clientId" field.
Declaration
public const int ClientIdFieldNumber = 3
Field Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
DataFieldNumber
Field number for the "data" field.
Declaration
public const int DataFieldNumber = 2
Field Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
MessageNameFieldNumber
Field number for the "messageName" field.
Declaration
public const int MessageNameFieldNumber = 1
Field Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
OperationIdFieldNumber
Field number for the "operationId" field.
Declaration
public const int OperationIdFieldNumber = 4
Field Value
 Type |  Description
 System.Int32
Properties
Improve this Doc   View Source
ClientId
Declaration
public string ClientId { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Data
Declaration
public string Data { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Descriptor
Declaration
public static MessageDescriptor Descriptor { get; }
Property Value
 Type |  Description
 Google.Protobuf.Reflection.MessageDescriptor
Improve this Doc   View Source
MessageName
Declaration
public string MessageName { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
OperationId
Declaration
public string OperationId { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Parser
Declaration
public static MessageParser<GrpcMessage> Parser { get; }
Property Value
 Type |  Description
 Google.Protobuf.MessageParser<GrpcMessage>
Methods
Improve this Doc   View Source
CalculateSize()
Declaration
public int CalculateSize()
Returns
 Type |  Description
 System.Int32
Improve this Doc   View Source
Clone()
Declaration
public GrpcMessage Clone()
Returns
 Type |  Description
 GrpcMessage
Improve this Doc   View Source
Equals(GrpcMessage)
Declaration
public bool Equals(GrpcMessage other)
Parameters
 Type |  Name |  Description
 GrpcMessage |  other
Returns
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Equals(Object)
Declaration
public override bool Equals(object other)
Parameters
 Type |  Name |  Description
 System.Object |  other
Returns
 Type |  Description
 System.Boolean
Overrides
System.Object.Equals(System.Object)
Improve this Doc   View Source
GetHashCode()
Declaration
public override int GetHashCode()
Returns
 Type |  Description
 System.Int32
Overrides
System.Object.GetHashCode()
Improve this Doc   View Source
MergeFrom(CodedInputStream)
Declaration
public void MergeFrom(CodedInputStream input)
Parameters
 Type |  Name |  Description
 Google.Protobuf.CodedInputStream |  input
Improve this Doc   View Source
MergeFrom(GrpcMessage)
Declaration
public void MergeFrom(GrpcMessage other)
Parameters
 Type |  Name |  Description
 GrpcMessage |  other
Improve this Doc   View Source
ToString()
Declaration
public override string ToString()
Returns
 Type |  Description
 System.String
Overrides
System.Object.ToString()
Improve this Doc   View Source
WriteTo(CodedOutputStream)
Declaration
public void WriteTo(CodedOutputStream output)
Parameters
 Type |  Name |  Description
 Google.Protobuf.CodedOutputStream |  output
Explicit Interface Implementations
Improve this Doc   View Source
IBufferMessage.InternalMergeFrom(ref ParseContext)
Declaration
void IBufferMessage.InternalMergeFrom(ref ParseContext input)
Parameters
 Type |  Name |  Description
 Google.Protobuf.ParseContext |  input
Improve this Doc   View Source
IBufferMessage.InternalWriteTo(ref WriteContext)
Declaration
void IBufferMessage.InternalWriteTo(ref WriteContext output)
Parameters
 Type |  Name |  Description
 Google.Protobuf.WriteContext |  output
Improve this Doc   View Source
IMessage.Descriptor
Declaration
MessageDescriptor IMessage.Descriptor { get; }
Returns
 Type |  Description
 Google.Protobuf.Reflection.MessageDescriptor
Implements
 Google.Protobuf.IMessage<T>
 System.IEquatable<T>
 Google.Protobuf.IDeepCloneable<T>
 Google.Protobuf.IBufferMessage
 Google.Protobuf.IMessage
 Improve this Doc
 View Source